* IN-PROGRESS get close to Lem-in [0/3]
SCHEDULED: <2019-10-01 Tue 00:00> DEADLINE: <2019-10-28 Mon>

- State "IN-PROGRESS" from "TODO"       [2019-10-02 Wed 06:05]

DEADLINE: <2019-10-27 Wed>

I must do something!! Graphs are l9wada! but first ,I have to finish the following

+ [-] checker
+ [ ] push_swap
+ [ ] visualizer

* IN-PROGRESS checker [0/3]
DEADLINE: <2019-10-05 Sat>
:PROPERTIES:
:Effort:   10:00
:END:
:LOGBOOK:
CLOCK: [2019-10-09 Wed 18:03]
CLOCK: [2019-10-08 Tue 02:38]--[2019-10-08 Tue 03:53] =>  1:15
CLOCK: [2019-10-08 Tue 01:21]--[2019-10-08 Tue 01:46] =>  0:25
CLOCK: [2019-10-08 Tue 00:40]--[2019-10-08 Tue 01:21] =>  0:41
CLOCK: [2019-10-03 Thu 22:03]--[2019-10-04 Fri 00:40] =>  2:37
CLOCK: [2019-10-03 Thu 03:51]--[2019-10-03 Thu 11:35] =>  7:44
CLOCK: [2019-10-03 Thu 03:47]--[2019-10-03 Thu 03:51] =>  0:04
:END:

- State "IN-PROGRESS" from "TODO"       [2019-10-02 Wed 06:02]
- State "PENDING"    from "TODO"       [2019-10-02 Wed 06:00]


I need to work at least 8hrs/day on this so that O can finish it once and for all

- [ ] write the core operation
- [ ] build a simple instruction input system
- [ ] test the algorithm on it

** DONE import libft from gitlab
DEADLINE: <2019-10-03 Thu 00:00>

- State "DONE"       from "IN-PROGRESS" [2019-10-03 Thu 22:03]
- State "IN-PROGRESS" from "TODO"       [2019-10-02 Wed 17:44]

need to fix some errors of making before setting this to DONE! <2019-10-03 Thu 00:52> now I'm working on the checker!

* TODO OMG! push_swap [0/3]
SCHEDULED: <2019-10-06 Sun 09:00> DEADLINE: <2019-10-14 Mon 00:00>

- State "PENDING"    from "TODO"       [2019-10-02 Wed 07:20]
- State "PENDING"    from "IN-PROGRESS" [2019-10-02 Wed 06:02]
- State "IN-PROGRESS" from "TODO"       [2019-10-02 Wed 06:00]

DEADLINE: <2019-10-15 Tue 00:00>
SCHEDULED: <2019-10-07 Mon 09:00>

Jalal's idea seems good, I'll see what I can do with it:

#+begin_quote
it said that I need to find the mids, and then push to stack B. After that, retrieve elements from stack B applying the same operation but in reverse.

/NOTE/: the miss leading that I have is *how to sort when getting things back*
#+end_quote

- [ ] document on the algos
  - [ ] QuickSort
  - [ ] MergeSort
  - [ ] BlockSort
- [ ] write a detailed version of it
- [ ] implement it from /bottom to top/

* PENDING DOPAMINE! visualizer!!                                   :optional:
SCHEDULED: <2019-10-16 Wed> DEADLINE: <2019-10-21 Mon>

- State "PENDING"    from "TODO"       [2019-10-02 Wed 06:00]
